2020/schedule.md
---
layout: page_2020
title: Schedule
year: 2020
permalink: /2020/schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>

Lecture slides can be found [here](https://drive.google.com/open?id=1aVYDxtstZ6o1dNHph0rFecqq5xuZip8C).
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 4</td>
<td class="org-left">overview and simple perceptron</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 6</td>
<td class="org-left">delta rule</td>
</tr>

<tr>
<td class="org-left">Pset 0 optional</td>
<td class="org-left">Feb. 11</td>
<td class="org-left">math review</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 11</td>
<td class="org-left">gradient optimization</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 13</td>
<td class="org-left">gradient learning</td>
</tr>

<tr>
<td class="org-left">Pset 1 due</td>
<td class="org-left">Feb. 18</td>
<td class="org-left">simple perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 18</td>
<td class="org-left">multilayer perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 20</td>
<td class="org-left">backpropagation</td>
</tr>

<tr>
<td class="org-left">Pset 2 due</td>
<td class="org-left">Feb. 25</td>
<td class="org-left">multilayer perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 25</td>
<td class="org-left">training</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 27</td>
<td class="org-left">generalization</td>
</tr>

<tr>
<td class="org-left">Pset 3 due</td>
<td class="org-left">Mar. 3</td>
<td class="org-left">black art of backprop</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 3</td>
<td class="org-left">convolution and pooling</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 5</td>
<td class="org-left">object recognition, image-to-image</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 10</td>
<td class="org-left">biological vision</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 12</td>
<td class="org-left">deep metric learning</td>
</tr>

<tr>
<td class="org-left">Pset 4 due</td>
<td class="org-left">Mar. 12</td>
<td class="org-left">LeNet</td>
</tr>

<tr>
<td class="org-left">Spring break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Midterm</td>
<td class="org-left">Mar. 24</td>
<td class="org-left">midterm exam</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 26</td>
<td class="org-left">clustering and PCA as neural nets</td>
</tr>

<tr>
<td class="org-left">Pset 5 due</td>
<td class="org-left">Mar. 31</td>
<td class="org-left">UNet</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 31</td>
<td class="org-left">autoencoders</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 2</td>
<td class="org-left">n-grams and word embeddings</td>
</tr>

<tr>
<td class="org-left">Pset 6 due</td>
<td class="org-left">Apr. 7</td>
<td class="org-left">autoencoders</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 7</td>
<td class="org-left">RNNs, multistability</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 9</td>
<td class="org-left">RNNs, LSTMs, sequences</td>
</tr>

<tr>
<td class="org-left">Pset 7 due</td>
<td class="org-left">Apr. 14</td>
<td class="org-left">word embeddings</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 14</td>
<td class="org-left">seq2seq tasks</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 16</td>
<td class="org-left">transformer models</td>
</tr>

<tr>
<td class="org-left">Pset 8 due</td>
<td class="org-left">Apr. 21</td>
<td class="org-left">sequence generation</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 21</td>
<td class="org-left">policy gradient</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 23</td>
<td class="org-left">Markov decision processes</td>
</tr>

<tr>
<td class="org-left">Pset 9 due</td>
<td class="org-left">Apr. 28</td>
<td class="org-left">sequence to sequence</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 28</td>
<td class="org-left">value iteration</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 30</td>
<td class="org-left">final review</td>
</tr>

<tr>
<td class="org-left">Pset 10 optional</td>
<td class="org-left">May 7</td>
<td class="org-left">deep reinforcement learning</td>
</tr>

<tr>
<td class="org-left">Final</td>
<td class="org-left">TBA</td>
<td class="org-left">final exam</td>
</tr>
</tbody>
</table>
